#Задача 2. Уровень - да ты математик.
#Условие: Подсчет площади и периметра прямоугольника.
#Входные данные: стороны% a% и% b% прямоугольника. 
#Выходные данные: площадь и периметр данного прямоугольника.
a = int( input())
b = int( input())
p = 2*a + b*2 
c = a*b
print("Периметр", p , "Площадь", c)